export default {
  navigation: {
    home: "Головна",
    about: "Про нас",
    contacts: "Контакти",
  },
  auth: {
    login: "Увійти",
    register: "Реєстрація",
    logout: "Вийти",
  },
  home: {
    welcome: "Зберігає ваші контакти",
    features: "Що ви можете робити:",
    createContacts: "Створювати нові контакти",
    viewContacts: "Переглядати наявні контакти",
    editContacts: "Редагувати інформацію контактів",
    deleteContacts: "Видаляти непотрібні контакти",
    startNow: "Почніть зараз - створіть обліковий запис або увійдіть",
    organize:
      "Організуйте свої контакти легко та ефективно з нашим зручним додатком!",
    createContactsDesc:
      "Додавайте нові контакти з усіма необхідними даними для легкого управління.",
    viewContactsDesc:
      "Отримуйте швидкий доступ до всієї вашої контактної інформації.",
    editContactsDesc:
      "Оновлюйте дані контактів у будь-який час для актуальності.",
    deleteContactsDesc: "Легко видаляйте контакти, які більше не потрібні.",
  },
  contacts: {
    title: "Ваші Контакти",
    loading: "Завантаження...",
    search: "Пошук контактів",
    addContact: "Додати контакт",
    name: "Ім'я",
    number: "Номер",
    delete: "Видалити",
    edit: "Редагувати",
    save: "Зберегти",
    cancel: "Скасувати",
  },
  about: {
    title: "Про нас",
    description:
      "Менеджер Контактів ContactKeeper - це ваш надійний інструмент для організації контактів",
    createContacts: "Створення нових контактів",
    createContactsDesc:
      "Легко додавайте нові контакти з важливими даними для зручного управління",
    viewContacts: "Перегляд наявних контактів",
    viewContactsDesc:
      "Зручно переглядайте усю вашу контактну інформацію, зібрану в одному місці",
    editContacts: "Редагування інформації контактів",
    editContactsDesc: "Оновлюйте дані контактів, щоб зберігати їх актуальними",
    deleteContacts: "Видалення непотрібних контактів",
    deleteContactsDesc:
      "Видаляйте контакти, які більше не потрібні, щоб підтримувати порядок",
    search: "Пошук контактів",
    searchDesc:
      "Швидко знаходьте потрібні контакти за іменем чи іншими характеристиками",
    features: "Наші ключові можливості:",
  },
  footer: {
    mainText:
      "ContactKeeper — це зручний і безпечний сервіс для зберігання та управління вашими контактами. Ми допомагаємо вам легко зберігати, знаходити та оновлювати інформацію про друзів, колег та партнерів, гарантуючи захист ваших даних та конфіденційність.",
    copyright: "© 2024 ContactKeeper. Всі права захищені.",
  },
};
