export default {
  navigation: {
    home: "Головна",
    about: "Про нас", 
    contacts: "Контакти",
  },
  auth: {
    login: "Увійти",
    register: "Реєстрація",
    logout: "Вийти",
  },
  home: {
    welcome: "Зберігає ваші контакти",
    features: "Що ви можете робити:",
    createContacts: "Створювати нові контакти",
    viewContacts: "Переглядати наявні контакти",
    editContacts: "Редагувати інформацію контактів", 
    deleteContacts: "Видаляти непотрібні контакти",
    startNow: "Почніть зараз - створіть обліковий запис або увійдіть",
    organize:
      "Організуйте свої контакти легко та ефективно з нашим зручним додатком!",
  },
  contacts: {
    title: "Ваші Контакти",
    loading: "Завантаження...",
    search: "Пошук контактів",
    addContact: "Додати контакт",
    name: "Ім'я",
    number: "Номер",
    delete: "Видалити",
    edit: "Редагувати",
    save: "Зберегти",
    cancel: "Скасувати",
  },
  about: {
    title: "Про нас",
    description:
      "Менеджер Контактів - це ваш надійний інструмент для організації контактів",
  },
  footer: {
    mainText: "ContactKeeper — це зручний і безпечний сервіс для зберігання та управління вашими контактами. Ми допомагаємо вам легко зберігати, знаходити та оновлювати інформацію про друзів, колег та партнерів, гарантуючи захист ваших даних та конфіденційність.",
    copyright: "© 2024 ContactKeeper. Всі права захищені."
  }
};
