export default {
  navigation: {
    home: "Головна",
    about: "Про нас",
    contacts: "Контакти",
  },
  auth: {
    login: "Увійти",
    register: "Реєстрація", 
    logout: "Вийти",
    registerButton: "Зареєструватися",
    agreement: "Я погоджуюся з умовами ліцензійного договору",
    agreementTitle: "Ліцензійний договір",
    agreementText: "Використовуючи сервіс \"Менеджер Контактів\" (\"Сервіс\"), що надається компанією (\"Компанія\"), ви погоджуєтеся з умовами цієї Ліцензійної Угоди. Якщо ви не згодні з цими умовами, будь ласка, не використовуйте Сервіс.\n\nКомпанія надає обмежену, невиключну ліцензію на доступ та використання Сервісу для особистих, некомерційних цілей. Забороняються несанкціоновані дії, такі як втручання в роботу Сервісу, збирання даних інших користувачів чи використання Сервісу для незаконних цілей.\n\nВесь вміст, логотипи та торгові марки, що знаходяться в Сервісі, є власністю Компанії або її ліцензіарів. Відтворення, модифікація чи поширення цього контенту без дозволу заборонені. Обробка даних користувачів здійснюється відповідно до Політики конфіденційності, з якою користувачі погоджуються, користуючись Сервісом.\n\nСервіс надається \"як є\" без жодних гарантій щодо його роботи. Компанія не несе відповідальності за можливі збитки, що виникають у зв'язку з використанням або неможливістю використання Сервісу. Компанія залишає за собою право припинити доступ у разі порушення умов цієї Угоди.\n\nЗ питаннями або для отримання додаткової інформації звертайтесь за контактами, вказаними на вебсайті Сервісу.",
  },
  home: {
    welcome: "Зберігає ваші контакти",
    features: "Що ви можете робити:",
    createContacts: "Створювати нові контакти",
    viewContacts: "Переглядати наявні контакти",
    editContacts: "Редагувати інформацію контактів",
    deleteContacts: "Видаляти непотрібні контакти",
    startNow: "Почніть зараз - створіть обліковий запис або увійдіть",
    organize:
      "Організуйте свої контакти легко та ефективно з нашим зручним додатком!",
    createContactsDesc:
      "Додавайте нові контакти з усіма необхідними даними для легкого управління.",
    viewContactsDesc:
      "Отримуйте швидкий доступ до всієї вашої контактної інформації.",
    editContactsDesc:
      "Оновлюйте дані контактів у будь-який час для актуальності.",
    deleteContactsDesc: "Легко видаляйте контакти, які більше не потрібні.",
  },
  contacts: {
    title: "Ваші Контакти",
    loading: "Завантаження...",
    search: "Пошук контактів",
    addContact: "Додати контакт",
    name: "Ім'я",
    number: "Номер телефона",
    delete: "Видалити",
    edit: "Редагувати",
    save: "Зберегти",
    cancel: "Скасувати",
    sortAsc: "Сортувати алфавітно (А-Я)",
    sortDesc: "Сортувати алфавітно (Я-А)",
    enterName: "Введіть ім'я",
    enterNumber: "Введіть номер телефона",
    addSuccess: "Контакт успішно додано",
    addError: "Щось пішло не так! Спробуйте ще раз пізніше",
  },
  about: {
    title: "Про нас",
    description:
      "Менеджер Контактів ContactKeeper - це ваш надійний інструмент для організації контактів",
    createContacts: "Створення нових контактів",
    createContactsDesc:
      "Легко додавайте нові контакти з важливими даними для зручного управління",
    viewContacts: "Перегляд наявних контактів",
    viewContactsDesc:
      "Зручно переглядайте усю вашу контактну інформацію, зібрану в одному місці",
    editContacts: "Редагування інформації контактів",
    editContactsDesc: "Оновлюйте дані контактів, щоб зберігати їх актуальними",
    deleteContacts: "Видалення непотрібних контактів",
    deleteContactsDesc:
      "Видаляйте контакти, які більше не потрібні, щоб підтримувати порядок",
    search: "Пошук контактів",
    searchDesc:
      "Швидко знаходьте потрібні контакти за іменем чи іншими характеристиками",
    features: "Наші ключові можливості:",
  },
  footer: {
    mainText:
      "ContactKeeper — це зручний і безпечний сервіс для зберігання та управління вашими контактами. Ми допомагаємо вам легко зберігати, знаходити та оновлювати інформацію про друзів, колег та партнерів, гарантуючи захист ваших даних та конфіденційність.",
    copyright: "© 2024 ContactKeeper. Всі права захищені.",
  },
  delete: {
    confirmTitle: "Підтвердження видалення",
    confirmMessage: "Ви впевнені, що хочете видалити цей контакт?",
    cancel: "Скасувати",
    confirm: "Видалити",
  },
  edit: {
    title: "Редагувати контакт",
    description: "Оновити дані контакту:",
    nameLabel: "Ім'я",
    phoneLabel: "Номер телефону",
    cancel: "Скасувати",
    update: "Оновити",
  },
};
